[{"title":"How to Setup Github Contribution Grid Snake","author":"harshraj8843","date":"2022-02-23T00:00:00.000Z","description":"This post will help you in setting up github contribution grid snake aka snake game for your README.md like this... Github Contribution Grid Snake Lets Begin... Step 1 - Create New Repo If you want to continue with an existing repo, continue with step 2 Step 2 - Add Github Action Add this github action in your repo at path .github/workflows/snake-update.yml Step 3 - Run Workflow Run github action workflow manually for first time use. Step 4 - Use it in README.md At this point your github-contribution-grid-snake.gif is available at https://raw.githubusercontent.com/<your_username>/<repo_name>/output/github-contribution-grid-snake.gif Now copy-paste this in your README.md Don't forget to change <your_username> and <repo_name> with your own github username and reponame Done Congratulations !!! You have completed this setup","image":"https://raw.githubusercontent.com/codinasion/codinasion-blog/master/blog/how-to-setup-github-contribution-grid-snake/images/hero.png","tags":["github"],"contributors":[],"slug":"how-to-setup-github-contribution-grid-snake"},{"title":"How to setup Github Personal Access Token","author":"harshraj8843","date":"2022-03-02T00:00:00.000Z","description":"Github Personal access token (PAT) is an alternative to using passwords for authentication to GitHub when using the GitHub API or the command line. This post will help you in setting up github personal access token (PAT) Step 1 Goto Settings Step 2 Goto Developer Settings Step 3 Generate Token Goto Personal Access Token Click Generate New Token leave all check boxes blank click generate token Note Don't forget to copy the token and save it somewhere safe Done !!! For more info, see this github docs","image":"https://raw.githubusercontent.com/codinasion/codinasion-blog/master/blog/how-to-setup-github-personal-access-token/images/hero.png","tags":["github"],"contributors":[],"slug":"how-to-setup-github-personal-access-token"}]